text = """Любіть Україну, як сонце любіть,
як вітер, і трави, і води...
В годину щасливу і в радості мить,
любіть у годину негоди.
Любіть Україну у сні й наяву,
вишневу свою Україну,
красу її, вічно живу і нову,
і мову її солов'їну.
Без неї — ніщо ми, як порох і дим,
розвіяний в полі вітрами...
Любіть Україну всім серцем своїм
і всіми своїми ділами."""

words = text.replace(",", "").replace(".", "").split()

count = {}

for word in words:
    count[word] = count.get(word, 0) + 1

w_max = max(count, key=count.get)
w_min = min(count, key=count.get)

print(f"Слово з найбільшою кількістю входжень: '{w_max}' ({count[w_max]} разів)")
print(f"Слово з найменшою кількістю входжень: '{w_min}' ({count[w_min]} разів)")
